In [37]:
import pandas as pd

In [38]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry', dtype={'continent':str})

In [39]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [40]:
drinks.groupby('continent')['beer_servings'].mean()

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64

In [41]:
drinks[drinks['continent'] == 'Africa'].beer_servings.mean()

61.471698113207545

In [42]:
drinks.groupby('continent')['beer_servings'].max()

continent
Africa           376
Asia             247
Europe           361
North America    285
Oceania          306
South America    333
Name: beer_servings, dtype: int64

In [43]:
drinks.groupby('continent')['beer_servings'].min()

continent
Africa            0
Asia              0
Europe            0
North America     1
Oceania           0
South America    93
Name: beer_servings, dtype: int64

In [44]:
drinks.groupby('continent')['beer_servings'].agg(['count', 'max', 'min', 'mean', 'std', 'var'])

               count  max  min        mean        std          var
continent
Africa            53  376    0   61.471698  80.557816  6489.561684
Asia              44  247    0   37.045455  49.469725  2447.253700
Europe            45  361    0  193.777778  99.631569  9926.449495
North America     23  285    1  145.434783  79.621163  6339.529644
Oceania           16  306    0   89.687500  96.641412  9339.562500
South America     12  333   93  175.083333  65.242845  4256.628788

In [45]:
drinks.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
Africa,61.471698,16.339623,16.264151,3.007547
Asia,37.045455,60.840909,9.068182,2.170455
Europe,193.777778,132.555556,142.222222,8.617778
North America,145.434783,165.739130,24.521739,5.995652
Oceania,89.687500,58.437500,35.625000,3.381250
South America,175.083333,114.750000,62.416667,6.308333

In [47]:
table = drinks.groupby('continent').mean()

In [50]:
table

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
Africa,61.471698,16.339623,16.264151,3.007547
Asia,37.045455,60.840909,9.068182,2.170455
Europe,193.777778,132.555556,142.222222,8.617778
North America,145.434783,165.739130,24.521739,5.995652
Oceania,89.687500,58.437500,35.625000,3.381250
South America,175.083333,114.750000,62.416667,6.308333